Autodesk.Revit.DB.Visual.AssetPropertyBoolean.Value
The value of the property.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input value is invalid for this AssetPropertyBoolean property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The asset property is not editable.

Autodesk.Revit.DB.Visual.AssetPropertyBoolean
Represents a property of material.